In [1]:
import pandas as pd
import numpy as np

In [32]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [33]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [34]:
for i in df.index:
    if pd.isnull(df.iloc[i,1]):
        df.iloc[i,1]=df.iloc[i-1,1]+10
print(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [35]:
df['From_To']=df['From_To'].str.split(pat="_")
df

               From_To  FlightNumber  RecentDelays              Airline
0      [LoNDon, paris]       10045.0      [23, 47]               KLM(!)
1      [MAdrid, miLAN]       10055.0            []    <Air France> (12)
2  [londON, StockhOlm]       10065.0  [24, 43, 87]  (British Airways. )
3    [Budapest, PaRis]       10075.0          [13]       12. Air France
4   [Brussels, londOn]       10085.0      [67, 32]          "Swiss Air"

In [36]:
a=[]
b=[]
for i in df.index:
    df1=df['From_To'][i][0]
    df2=df['From_To'][i][1]
    a.append(df1)
    b.append(df2)
print(a)
print(b)

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']
['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [37]:
temp_data=pd.DataFrame([a,b], index=['from','to']).transpose()
temp_data

       from         to
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [38]:
temp1=temp_data['from'].str.title()
temp2=temp_data['to'].str.title()

In [45]:
print(temp1)
print(temp2)

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: from, dtype: object
0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: to, dtype: object

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [39]:
df=pd.concat([df,temp1], axis=1)
df=pd.concat([df,temp2], axis=1)

In [43]:
df=df.drop(['From_To'], axis=1)

In [44]:
df

   FlightNumber  RecentDelays              Airline      from         to
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
Note: Solution submitted via github must contain all the source code and output.

In [46]:
df1=df

In [74]:
check=df1['RecentDelays']

In [90]:
for i in check.index:
    if len(check[i])<3:
        check[i].append(np.NaN)
print(check)

0      [23, 47, nan]
1    [nan, nan, nan]
2       [24, 43, 87]
3     [13, nan, nan]
4      [67, 32, nan]
Name: RecentDelays, dtype: object

In [96]:
check

0      [23, 47, nan]
1    [nan, nan, nan]
2       [24, 43, 87]
3     [13, nan, nan]
4      [67, 32, nan]
Name: RecentDelays, dtype: object

In [98]:
check[0][0]

23

In [103]:
x=[]
y=[]
z=[]

for i in check.index:
    df_1=check[i][0]
    df_2=check[i][1]
    df_3=check[i][2]
    x.append(df_1)
    y.append(df_2)
    z.append(df_3)

print(x)
print(y)
print(z)

[23, nan, 24, 13, 67]
[47, nan, 43, nan, 32]
[nan, nan, 87, nan, nan]

In [105]:
check_df=pd.DataFrame([x,y,z], index=['delay_1', 'delay_2', 'delay_3']).transpose()
check_df

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [108]:
type(check_df)

pandas.core.frame.DataFrame

In [109]:
df1=pd.concat([df1,check_df], axis=1)

In [112]:
df1=df1.drop(['RecentDelays'], axis=1)
df1

,FlightNumber,Airline,from,to,delay_1,delay_2,delay_3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN